---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.FailToConvertLine
source: html/e857c78f-1b86-08f9-17d9-4b24e1b1dc27.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.FailToConvertLine Property

Unable to convert lines

## Syntax (C#)
```csharp
public static FailureDefinitionId FailToConvertLine { get; }
```